%%
%kalman theory
%1. 预测 
%   xt^=Fx(t-1)^+Bu(t-1) 表示系统的状态转移，F状态转移矩阵   x(t-1)^是上时刻系统量
%   ut-1为系统控制量，上一时刻
%   S = V0t+1/2at?，还有Vt = V0+at。其中在每一个时刻的V0即相当于上一时刻的速度即Vt-1。
%   则此时的方程就应该为[St;Vt] = [1 t;0 1][St-1;Vt-1] + [1/2*t?;t]*ut-1
%2. 误差传递更新
%   Pt=FP(t-1)F'+Q
%   Pt误差协方差矩阵，传递上式产生的误差
%   Q误差协方差，Wt-1期望/噪声协方差

%3. 更新
%   xt^n|n=xt^n|n-1-^+Kt(zt-Hxt^n|n-1)；zt=Hxt^
%   此刻n|n时刻由系统n|n-1，以及卡尔曼项修正
%   zt为可观测量；Hxt^为其线性估计，修正项为误差值
%4. 卡尔曼系数
%   Kt=Pt-(n|n-1)H'(HPt-(n|n-1)H'+R)^-1
%   H观测控制矩阵，两种观测值所得： 一、由预测xt^=Fxt^- 马尔可夫过程求得 二、观测值z^=Hx^
%   R:观测协方差矩阵 ----z^=Hx^+v
%   R=vv'
%5. 观测矩阵更新
%   Pt=(I-KtH)Pt-
%   更新Pt值

%% kalman 估计匀速运动车真实状态
clc
clear
Z=(1:100);%观测值 1-100 车距离变化
noise=randn(1,100);
Z=Z+noise;% 观测值加入噪声

X=[0;0];%初始状态=s[-1]~(us.sethas)
P=[1 0;0 1];%转移矩阵初值
A=[1 1;0 1];%t采样频率=1 每秒一次
Q=[0.0001 0; 0 0.0001];% Q方差小  Q=ww' 表明预测值误差很小 可信
H=[1 0]; %x=Hx^+v x=[位移；速度]
R=1; %R=vv' 观测项噪声协方差

%%
figure;
hold on;
for i=1:100 %迭代100次
        X_=A*X; %忽略B*ut-1，无加速度 X_=[11;01]*[0;0]
        P_=A*P*A'+Q'; %
        
        
        K=P_*H'/(H*P_*H'+R);    
        X=X_+K*(Z(i)-H*X_); %更新项，卡尔曼增益
        P=(eye(2)-K*H)*P_;  %5项 完成kalman系统
        
        plot(X(1), X(2), 'r.'); % 画出小车运动的两个状态,估计出小车的最优真实估计状态解
    plot(X_(1), X_(2), 'b.'); % 画出小车运动的两个状态,估计出小车的最优预测状态解
    hold on;
end
%%  原理式 n+1|n=n+1时刻 和 n时刻预测递推 x^为系统估计
%1. x^n+1|n=Fn*x^n|n
%2. Pn+1|n=Fn*Pn|n*Fn+Qn
%3. Kn+1=Pn+1|n*Hn+1'*(Hn+1*Pn|n*Hn+1'+Rn+n)^-1
%4. x^n+1|n+1=x^n+1|n+Kn+1*(Yn+1-Hn+1*x^n+1|n)
%5. Pn+1|n+1=(I-Kn+1*Hn+1)*Pn+1|n

%动态系统表达式
% x^n+1|n+1=A*x^n+1|n+B*u^n+1+wn
% yn+1=Hn+1*x^n+1|n + vn+1
% K=模型预测误差/量测误差 K=0预测无误差；K=1量测无误差






















